# GetSpecificationName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetSpecificationName Method
FabricationConfiguration Class See Also
---
Gets the specification name from its identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string GetSpecificationName(
	int specId
)
```

Visual Basic
---
```text
Public Function GetSpecificationName ( _
	specId As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetSpecificationName(
	int specId
)
```

# ### Parameters
specId
    Type: System..::..Int32 The specification identifier.
# ### Return Value
The specification name;
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace